In [3]:
from IPython.display import display, HTML
display(HTML("<style>.container { width:75% !important; }</style>"))

import pandas as pd

# 4.4 Merging multiple datasets

In [6]:
person = pd.read_csv('./files/survey_person.csv')
site = pd.read_csv('./files/survey_site.csv')
survey = pd.read_csv('./files/survey_survey.csv')
visited = pd.read_csv('./files/survey_visited.csv')

In [5]:
person

      ident   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [7]:
site

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [8]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [9]:
survey

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

## 4.4.1 one-to-one merge

In [11]:
visited_subset = visited.loc[[0, 2, 6]]

o2o_merge = site.merge(visited_subset, left_on='name', right_on='site')

o2o_merge

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
2  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

### 4.4.2 Many-to-one merge

In [12]:
m2o_merge = site.merge(visited, left_on='name', right_on='site')
m2o_merge

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-1 -49.85 -128.57    622   DR-1  1927-02-10
2   DR-1 -49.85 -128.57    844   DR-1  1932-03-22
3   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
4   DR-3 -47.15 -126.72    735   DR-3  1930-01-12
5   DR-3 -47.15 -126.72    751   DR-3  1930-02-26
6   DR-3 -47.15 -126.72    752   DR-3         NaN
7  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

## 4.4.3 Many-to-many merge

In [15]:
ps = person.merge(survey, left_on='ident', right_on='person')
vs = visited.merge(survey, left_on='ident', right_on='taken')
ps, vs

(   ident   personal   family  taken person quant  reading
 0   dyer    William     Dyer    619   dyer   rad     9.82
 1   dyer    William     Dyer    619   dyer   sal     0.13
 2   dyer    William     Dyer    622   dyer   rad     7.80
 3   dyer    William     Dyer    622   dyer   sal     0.09
 4     pb      Frank  Pabodie    734     pb   rad     8.41
 5     pb      Frank  Pabodie    734     pb  temp   -21.50
 6     pb      Frank  Pabodie    735     pb   rad     7.22
 7     pb      Frank  Pabodie    751     pb   rad     4.35
 8     pb      Frank  Pabodie    751     pb  temp   -18.50
 9   lake   Anderson     Lake    734   lake   sal     0.05
 10  lake   Anderson     Lake    751   lake   sal     0.10
 11  lake   Anderson     Lake    752   lake   rad     2.19
 12  lake   Anderson     Lake    752   lake   sal     0.09
 13  lake   Anderson     Lake    752   lake  temp   -16.00
 14  lake   Anderson     Lake    837   lake   rad     1.46
 15  lake   Anderson     Lake    837   lake   sal     0.21
 16   roe  Valentina  Roerich    752    roe   sal    41.60
 17   roe  Valentina  Roerich    837    roe   sal    22.50
 18   roe  Valentina  Roerich    844    roe   rad    11.25,
     ident   site       dated  taken person quant  reading
 0     619   DR-1  1927-02-08    619   dyer   rad     9.82
 1     619   DR-1  1927-02-08    619   dyer   sal     0.13
 2     622   DR-1  1927-02-10    622   dyer   rad     7.80
 3     622   DR-1  1927-02-10    622   dyer   sal     0.09
 4     734   DR-3  1939-01-07    734     pb   rad     8.41
 5     734   DR-3  1939-01-07    734   lake   sal     0.05
 6     734   DR-3  1939-01-07    734     pb  temp   -21.50
 7     735   DR-3  1930-01-12    735     pb   rad     7.22
 8     735   DR-3  1930-01-12    735    NaN   sal     0.06
 9     735   DR-3  1930-01-12    735    NaN  temp   -26.00
 10    751   DR-3  1930-02-26    751     pb   rad     4.35
 11    751   DR-3  1930-02-26    751     pb  temp   -18.50
 12    751   DR-3  1930-02-26    751   lake   sal     0.10
 13    752   DR-3         NaN    752   lake   rad     2.19
 14    752   DR-3         NaN    752   lake   sal     0.09
 15    752   DR-3         NaN    752   lake  temp   -16.00
 16    752   DR-3         NaN    752    roe   sal    41.60
 17    837  MSK-4  1932-01-14    837   lake   rad     1.46
 18    837  MSK-4  1932-01-14    837   lake   sal     0.21
 19    837  MSK-4  1932-01-14    837    roe   sal    22.50
 20    844   DR-1  1932-03-22    844    roe   rad    11.25)

In [19]:
ps_vs = ps.merge(vs,
                 left_on=['ident', 'taken', 'quant', 'reading'],
                right_on=['person', 'ident', 'quant', 'reading'])

ps_vs.loc[0]

ident_x           dyer
personal       William
family            Dyer
taken_x            619
person_x          dyer
quant              rad
reading           9.82
ident_y            619
site              DR-1
dated       1927-02-08
taken_y            619
person_y          dyer
Name: 0, dtype: object